hathach/tinyusb/hw/bsp/at32f423/boards/AT_START_F423/AT32F423xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QSPI1</name>
      <description>Quad SPI Controller</description>
      <groupName>QSPI</groupName>
      <baseAddress>0xA0001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>QSPI1</name>
        <description>QSPI1 global interrupt</description>
        <value>92</value>
      </interrupt>
      <registers>
        <register>
          <name>CMD_W0</name>
          <displayName>CMD_W0</displayName>
          <description>Command word 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPIADR</name>
              <description>SPI flash address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_W1</name>
          <displayName>CMD_W1</displayName>
          <description>Command word 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01000003</resetValue>
          <fields>
            <field>
              <name>ADRLEN</name>
              <description>SPI address length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DUM2</name>
              <description>Second dummy state cycle</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INSLEN</name>
              <description>Instruction code length</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PEMEN</name>
              <description>Perfrmance enhance mode enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_W2</name>
          <displayName>CMD_W2</displayName>
          <description>Command word 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01000003</resetValue>
          <fields>
            <field>
              <name>DCNT</name>
              <description>Read write data counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_W3</name>
          <displayName>CMD_W3</displayName>
          <description>Command word 3</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WEN</name>
              <description>Write data enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTSEN</name>
              <description>Read spi status enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTSC</name>
              <description>Read spi status configure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPMODE</name>
              <description>SPI operate mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PEMOPC</name>
              <description>Performance enhance mode operate code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INSC</name>
              <description>Instruction code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>SPI clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SCKMODE</name>
              <description>Sckout mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XIPIDLE</name>
              <description>XIP port idle status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort instruction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy bit of spi status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XIPRCMDF</name>
              <description>XIP read command flush</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XIPSEL</name>
              <description>XIP port selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEYEN</name>
              <description>encryption key enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTR</name>
          <displayName>ACTR</displayName>
          <description>AC timing control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>CSDLY</name>
              <description>CS delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTS</name>
          <displayName>FIFOSTS</displayName>
          <description>FIFO Status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TXFIFORDY</name>
              <description>TxFIFO ready status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFORDY</name>
              <description>RxFIFO ready status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>control register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA handshake enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDIE</name>
              <description>Command complete interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOTHOD</name>
              <description>TxFIFO thod</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXFIFOTHOD</name>
              <description>RxFIFO thod</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTS</name>
          <displayName>CMDSTS</displayName>
          <description>CMD status register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDSTS</name>
              <description>Command complete status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTS</name>
          <displayName>RSTS</displayName>
          <description>SPI read status register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPISTS</name>
              <description>SPI read status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSIZE</name>
          <displayName>FSIZE</displayName>
          <description>SPI flash size</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPIFSIZE</name>
              <description>SPI flash size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XIP_CMD_W0</name>
          <displayName>XIP_CMD_W0</displayName>
          <description>XIP command word 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XIPR_DUM2</name>
              <description>XIP read second dummy cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>XIPR_OPMODE</name>
              <description>XIP read operate mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XIPR_ADRLEN</name>
              <description>XIP read address length</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XIPR_INSC</name>
              <description>XIP read instruction code</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XIP_CMD_W1</name>
          <displayName>XIP_CMD_W1</displayName>
          <description>XIP command word 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XIPW_DUM2</name>
              <description>XIP write second dummy cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>XIPW_OPMODE</name>
              <description>XIP write operate mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XIPW_ADRLEN</name>
              <description>XIP write address length</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XIPW_INSC</name>
              <description>XIP write instruction code</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XIP_CMD_W2</name>
          <displayName>XIP_CMD_W2</displayName>
          <description>XIP command word 2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XIPR_DCNT</name>
              <description>XIP read data counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>XIPR_TCNT</name>
              <description>XIP continue read cycle counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>XIPR_SEL</name>
              <description>XIP read continue mode select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XIPW_DCNT</name>
              <description>XIP write data counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>XIPW_TCNT</name>
              <description>XIP continue write cycle counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>XIPW_SEL</name>
              <description>XIP write continue mode select</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XIP_CMD_W3</name>
          <displayName>XIP_CMD_W3</displayName>
          <description>XIP command word 3</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASSC</name>
              <description>Bypass cache function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSTS</name>
              <description>Cache status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REV</name>
          <displayName>REV</displayName>
          <description>Revision</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010500</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Revision number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DT</name>
          <displayName>DT</displayName>
          <description>32/16/8 bit data port register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="QSPI1">
      <name>QSPI2</name>
      <baseAddress>0xA0002000</baseAddress>
      <interrupt>
        <name>QSPI2</name>
        <description>QSPI2 global interrupt</description>
        <value>91</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
